app/controllers/parses_controller.rb

  def index
    @parses = Parse.order('created_at DESC')
---
SELECT "parses".* FROM "parses" ORDER BY created_at DESC

  def create
    @parse = Parse.create(parse_params)
---
INSERT INTO "parses" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "define a text area or a string with C or C++ or Java or C#"], ["created_at", "2018-03-26 11:06:10.859640"], ["updated_at", "2018-03-26 11:06:10.859640"]]

  def show
    @parse = Parse.find(params[:id])
---
SELECT  "parses".* FROM "parses" WHERE "parses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]